package FullLesson;

public class Lesson5_6 {
    /* Ќа 5 уроке изучено пон€тие метода и констуктора.
    ѕри создании класса имеетс€ его дефолтный конструктор типа "им€()"
    ћожно создать любой свой конструктор, где будут нужные нам параметры.
    
     онструктор создаетс€ по имени класса и имеет параметры нужные в нем.
    
    им€ конструктора (нужные параметры) {
        тело
    }
    
    ћетод - может быть создан внутри конструктора, иметь другое им€, любые
    параметры на ввод. ѕишетс€ по принципу:
    
    тип данных - им€ (переменные) { 
        тело
        return type}
    
    ≈сли необходимо ничего не выводить, то пишетс€ метод void (нет return).
    */
    
    /* Ќа 6 уроке изучена перегрузка методов. ћетоды могут иметь одно им€, но
    разные параметры, и могут быть вызваны с помощью call method именно нужного
    нам метода в этот момент.
    
     онструкторы тоже могут быть перегружены, мен€ютс€ только параметры.
     лючевое слово this может вызывать конструктор внутри конструктора, 
    что позвол€ет иногда существенно сократить код. —начала пишетс€ самый
    большой конструктор, а дальше часть параметров можно занулить.
    */
}
