package FullLesson;
public class Lesson7_10 {
    /* На 7 уроке изучено понятие "пакет", пакет, по своей сути, это папка,
    хранилище классов. Папки могут лежать отдельно, а могут друг в друге, тогда
    это является подпакетами.
    Также изучены access modifire.
    public - AM, который позволяет увидеть данный класс/парааметр/метод в других
    пакетах.
    private - AM, с помощью которого можно скрыть данные только в этом классе.
    default - видны во всех классах данного пакета.
    protected - видны как в самом пакете, так и в классах-наследниках.
    
    На 8 уроке изучены Non-Access Modifire.
    final - создает константу, которую никак нельзя изменить.
    static - делает так, чтобы переменная не пренадлежала никакому объекту, а
    только классу, например, чтобы вести счетчик count.
    static method существует всегда, независимо от того, существует ли объект.
    Если метод статичный, то вызывается без объекта, напрямую.
    
    На 9 уроке изучены видимости параметров.
    Параметр, созданный в классе виден через конструкторы в этом классе.
    Параметр внутри метода, типа имя (параметр), виден во всем методе.
    так же есть параметры, созданные в методе и они видны с момента создания
    до закрытия этого метода.
    Через this можно вызывать статические элементы.
    
    Так же изучен Correct identifiers, названия могут начинаться с любой буквы,
    с знака _, могут иметь цифры, но не начинаться с нее и иметь любое количество
    символов.
    
    На 10 уроке изучен import, чтобы не образаться каждый раз в коде к переменной
    по длинному имени, можно просто импортировать класс (или все классы) в нужный
    пакет и обращаться уже по короткому имени. Тоже самое с статичной переменной.
    import static импортирует статичную переменную и к ней можно обращаться по 
    короткому имени.
    
    На 11 уроке рассказывается, что нельзя менять ссылки на объекты с помощью
    методов (создается зеркало), но можно повлиять на выходные данные, изменять
    и дополнять.
    */
    
    
    
}
