package FullLesson;
public class Lesson11 {
    /* 
    На 11 уроке было изучен, как меняется параметр внутри метода. Сначала
    создается зеркало, затем меняется, нельзя поменять адрес целиком, потому
    что джава работает с ссылочными типами данных. Можно изменить только его
    внутренний параметр. Пример ниже
    
    Вызываем объекты, которые надо изменить.
    public static void ColorSwap(Car c1, Car c2){
        И свапаем их местами. По такой же аналогии можно заменить что угодно.
        String color = c1.color;
        c1.color = c2.color;
        c2.color  = color;
    }
*/
}

